//
//  Policy.swift
//  Prototype
//
//  Created by SeoJunYoung on 12/18/25.
//


struct Policy {
    
    /// 스킬 강화별 가중치 [스킬이름 : 레벨 : 가중치]
    static let skillUpgradeWeights: [String: [Int: Int]] = [
        "웹 개발 초급": [
            1: 1,
            2: 2,
            3: 3,
            4: 4,
            5: 5,
            6: 6,
            7: 7,
            8: 8,
            9: 9,
            10: 10
        ],
        "웹 개발 중급": [
            1: 5,
            2: 10,
            3: 15,
            4: 20,
            5: 25,
            6: 30,
            7: 35,
            8: 40,
            9: 45,
            10: 50
        ],
        "웹 개발 고급": [
            1: 10,
            2: 20,
            3: 30,
            4: 40,
            5: 50,
            6: 60,
            7: 70,
            8: 80,
            9: 90,
            10: 100
        ]
    ]
}
